# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategorySet..::..Insert Method
CategorySet Class See Also
---
Insert the specified category into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	Category item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As Category _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	Category^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CategoryThe item to be inserted into the set.
# ### Return Value
Returns whether the item was inserted into the set.
# See Also
CategorySet Class
Autodesk.Revit.DB Namespace